2020.07.09 수업

## Pansdas

In [42]:
import numpy as np
import pandas as pd
dic = {'city' : ['서울', '부산', '대전', '대구', '광주'],
      'year' : [2017,2017,2018,2018,2018],
      'temp' : [18,19,20,21,20]}
data = pd.DataFrame(dic)
data

  city  year  temp
0   서울  2017    18
1   부산  2017    19
2   대전  2018    20
3   대구  2018    21
4   광주  2018    20

1. column 을 도시, 연도, 날씨 로 바꾸세요.

   도시    연도  날씨
0  서울  2017  18
1  부산  2017  19
2  대전  2018  20
3  대구  2018  21
4  광주  2018  20

2. 인덱스를 도시로 설정하세요.

   도시    연도  날씨
0  서울  2017  18
1  부산  2017  19
2  대전  2018  20
3  대구  2018  21
4  광주  2018  20

3. 
```
dic = {'city' : ['서울', '부산', '대전', '대구', '광주'],
      'year' : [2017,2017,2018,2018,2018],
      'temp' : [18,19,20,21,20]}
data = pd.DataFrame(dic)
```
원본의 인덱스를 city column으로 바꾸고 인덱스를 바꿀 때 원본이 바뀌도록 하세요.

In [49]:
dic = {'city' : ['서울', '부산', '대전', '대구', '광주'],
   'year' : [2017,2017,2018,2018,2018],
   'temp' : [18,19,20,21,20]}
data = pd.DataFrame(dic)
data

  city  year  temp
0   서울  2017    18
1   부산  2017    19
2   대전  2018    20
3   대구  2018    21
4   광주  2018    20

      year  temp
city
서울    2017    18
부산    2017    19
대전    2018    20
대구    2018    21
광주    2018    20

4. 서울, 부산, 대구 행을 출력하세요.

      year  temp
city
서울    2017    18
부산    2017    19
대구    2018    21

5. year, temp column을 출력하세요.

      year  temp
city
서울    2017    18
부산    2017    19
대전    2018    20
대구    2018    21
광주    2018    20

6. DataFrame 만들기
```
key = [city, year, temp]
['서울', '부산', '대전', '대구', '광주']
[2017,2017,2018,2018,2018]
[18,19,20,21,20]
```
city를 index로 설정하세요.

In [104]:
data = {'city' : ['서울', '부산', '대전', '대구', '광주'],
        'year' : [2017,2017,2018,2018,2018],
        'temp' : [18,19,20,21,20]}

      year  temp
city
서울    2017    18
부산    2017    19
대전    2018    20
대구    2018    21
광주    2018    20

7. 부산부터 대구까지의 행을 출력하세요.

      year  temp
city
부산    2017    19
대전    2018    20
대구    2018    21

8. 서울과 대전 행을 출력하세요.

      year  temp
city
서울    2017    18
부산    2017    19
대전    2018    20

9. 데이터 추가 - 열 추가하기
```
column에 car 데이터  [50,40,20,30,10]를 추가하세요.
```

      year  temp  car
city
서울    2017    18   50
부산    2017    19   40
대전    2018    20   20
대구    2018    21   30
광주    2018    20   10

10. 조건을 사용하여 high 데이터 추가하기.

```
차량 수 중 40 이상인 데이터를 high 로 추가하세요.
```

11. 원본을 변화시키지 않고 car 데이터를 빼고 출력하세요.

      year  temp   high
city
서울    2017    18   True
부산    2017    19   True
대전    2018    20  False
대구    2018    21  False
광주    2018    20  False

12. 원본을 변화시키고 car 데이터 삭제하고 원본데이터 출력하세요.

      year  temp   high
city
서울    2017    18   True
부산    2017    19   True
대전    2018    20  False
대구    2018    21  False
광주    2018    20  False

## Series

1. [4,7,-5,3] 인 시리즈 데이터 생성하세요.

0    4
1    7
2   -5
3    3
dtype: int64

2. [4,7,-5,3]이고 인덱스가 ['d','b','a','c']인 시리즈 생성하세요.

d    4
b    7
a   -5
c    3
dtype: int64

d    4
b    7
a   -5
c    3
dtype: int64

3. 시리즈 데이터 타입 출력하세요.

dtype('int64')

4. 각 도시의 인구데이터를 시리즈로 생성하고 인덱스를 도시로 설정하세요.
```
서울  9904312
부산  3448737
인천  2890451
대구  2466052
```

In [3]:
import pandas as pd
s = pd.Series([9904312, 3448737,2890451,  2466052], index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

5. 시리즈의 name 을 '인구'로 설정하세요.

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

6. 인덱스의 name을 '도시'로 설정하세요.

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

7. 인구데이터를 10만으로 나누어 출력하세요.

도시
서울    99.04312
부산    34.48737
인천    28.90451
대구    24.66052
Name: 인구, dtype: float64

8. 대구의 인구를 인덱싱으로 출력하세요.

In [10]:
s[[0,3,1]]
# s[["서울", "대구", "부산"]]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

9. 슬라이싱과 조건으로 행출력하세요. (1행부터 3행까지, 250만이상출력)

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

10. 인구가 250만 이상이고 500만 이하인 도시 출력하세요.

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

11. 아래의 데이터를 사용하여 시리즈 s2생성하세요.
```
data = {"서울" : 9123442, "부산" : 3333437,
       "인천" : 2234451, "대전" : 2423452}
       ```

In [132]:
data = {"서울" : 9123442, "부산" : 3333437,
        "인천" : 2234451, "대전" : 2423452}

서울    9123442
부산    3333437
인천    2234451
대전    2423452
dtype: int64

12. 두 시리즈 데이터의 차이를 나타낸 시리즈데이터를 출력하고 null이 아닌것을 출력하세요.

부산    115300.0
서울    780870.0
인천    656000.0
dtype: float64

## DataFrame

1. 아래의 데이터로 데이터 프레임을 생성하세요.

```
import pandas as pd

data = {"2015": [9123442,3333437,2234451,2423452],
       "2010" : [9904312,3448737,2890451,2466052]}
```

In [136]:
import pandas as pd

data = {"2015": [9123442,3333437,2234451,2423452],
       "2010" : [9904312,3448737,2890451,2466052]}
df = pd.DataFrame(data)
df

      2015     2010
0  9123442  9904312
1  3333437  3448737
2  2234451  2890451
3  2423452  2466052

2. 인덱스로 ['서울', '부산','인천','대구'] 추가하세요.

       2015     2010
서울  9123442  9904312
부산  3333437  3448737
인천  2234451  2890451
대구  2423452  2466052

3. 데이터만 들어있을 때 데이터 프레임 구성하기 df2

```
data = [[9123442,3333437,2234451,2423452],
        [9904312,3448737,2890451,2466052]]
idx = ['2015', '2010']
col = ['서울', '부산', '인천', '대구']
```

           서울       부산       인천       대구
2015  9123442  3333437  2234451  2423452
2010  9904312  3448737  2890451  2466052

4. 행과 열을 바꾸세요. - df3에 저장

       2015     2010
서울  9123442  9904312
부산  3333437  3448737
인천  2234451  2890451
대구  2423452  2466052

5. [9762546, 3512547, 2517680, 2456016]의 데이터를 2005 데이터로 추가하세요.

       2015     2010     2005
서울  9123442  9904312  9762546
부산  3333437  3448737  3512547
인천  2234451  2890451  2517680
대구  2423452  2466052  2456016

6. 2010데이터 중 250만 보다 큰 행을 출력하세요.

서울    9904312
부산    3448737
인천    2890451
Name: 2010, dtype: int64

7. 서울과 부산의 2015, 2010데이터를 출력하세요.

       2015     2010
서울  9123442  9904312
부산  3333437  3448737

8. 인덱스를 이용하여 7번을 출력하세요.

       2015     2010
서울  9123442  9904312
부산  3333437  3448737

## CSV 파일 1

In [206]:
import numpy as np
drive_path = r"c:/Apps/temp/"
p_number = pd.read_csv(drive_path + "population_number.csv",index_col="도시" ,encoding="euc-kr")
p_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

1. 열 데이터의 갯수를 출력하세요.

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

2. 
s에 0 부터 5까지의 랜덤한 정수 100개를 시리즈로 생성하고 각 값이 얼마나 나왔는지 출력하세요.

5    22
4    17
1    17
0    17
2    15
3    12
dtype: int64

3. 2010 열 데이터를 오름차순으로 정렬하여 나타내세요.

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

4. 전체 데이터를 2010데이터를 기준으로 정렬하세요.

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

5. 전체 데이터를 지역과 2010을 기준으로 정렬하세요.

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

## CSV 파일 2

1. score 변수에 csv데이터를 저장하고 출력하시오./
경로 : drive_path + "score.csv" /인덱스를 '과목'으로 설정하세요. /encoding='euc-kr'

In [18]:

score = pd.read_csv(r'C:\Users\hoins\Desktop\실습\실습_파이썬 라이브러리\라이브러리 실습\라이브러리_실습\datascore.csv',index_col='과목', encoding = 'euc-kr')
score

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\hoins\\Desktop\\실습\\실습_파이썬 라이브러리\\라이브러리 실습\\라이브러리_실습\\datascore.csv'

2. 각 반의 총점을 정렬하여 내림차순으로 출력하세요.

2반    388
3반    295
1반    271
4반    243
dtype: int64

3. 학생들의 성적을 과목에 대해 내림차순 정렬하세요.

과목
사회    298
영어    282
국어    253
수학    201
과학    163
dtype: int64

4. 전체 데이터에 합계 열을 추가하세요.

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

5. 각 반의 최고점을 출력하세요.

1반    92
2반    92
3반    85
4반    69
dtype: int64

6. 각 반의 최저점을 출력하세요.

1반    11
2반    44
3반    45
4반    26
dtype: int64

7. 각 반의 최고 최저점을 데이터 프레임으로 나타내세요. column 이름 = max, min

    Max  Min
1반   92   11
2반   92   44
3반   85   45
4반   69   26

8. score에 '평균' 열을 추가하세요.

    1반  2반  3반  4반   합계     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

9.'평균' 행을 추가하세요.

      1반    2반    3반    4반     합계     평균
과목
수학  45.0  44.0  73.0  39.0  201.0  50.25
영어  76.0  92.0  45.0  69.0  282.0  70.50
국어  47.0  92.0  45.0  69.0  253.0  63.25
사회  92.0  81.0  85.0  40.0  298.0  74.50
과학  11.0  79.0  47.0  26.0  163.0  40.75
평균  54.2  77.6  59.0  48.6  239.4  59.85

10. 각 과목별 최고 최저점의 차이를 출력하세요.

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

11. 차이가 가장 큰 과목 명을 출력하세요.

68.0

12. min_max(x) 함수를 만들고, apply를 사용하여 score에서 각 반의 최고 최저점의 차이를 출력하세요.

1반    81.0
2반    48.0
3반    40.0
4반    43.0
dtype: float64

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

13. df3의 데이터 중 각 수가 얼마나 사용되었는지 df4에 나타내세요. - apply

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

14. df4에서 NaN값 0으로 채우세요.

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

15. score의 정보 가져오세요.

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 수학 to 평균
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1반      6 non-null      float64
 1   2반      6 non-null      float64
 2   3반      6 non-null      float64
 3   4반      6 non-null      float64
 4   합계      6 non-null      float64
 5   평균      6 non-null      float64
dtypes: float64(6)
memory usage: 496.0+ bytes

16. score 데이터에서 앞에서부터 3개만 가져오세요.

      1반    2반    3반    4반     합계     평균
과목
수학  45.0  44.0  73.0  39.0  201.0  50.25
영어  76.0  92.0  45.0  69.0  282.0  70.50
국어  47.0  92.0  45.0  69.0  253.0  63.25

17. score 데이터에서 뒤에서부터 3개만 가져오세요.

      1반    2반    3반    4반     합계     평균
과목
사회  92.0  81.0  85.0  40.0  298.0  74.50
과학  11.0  79.0  47.0  26.0  163.0  40.75
평균  54.2  77.6  59.0  48.6  239.4  59.85

## 카테고리

1. 카테고리로 나타내기 cats변수에 저장하세요.

```
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
```

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 노년, 청년, 장년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

2. cats 의 카테고리 목록 출력

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

3. age_arr에 1번의 'ages' column을 하나를 생성하고 두번째 행에 카테고리로 열 'age_cat'을 생성하세요.

    ages ages_cat
0      0      NaN
1      2     미성년자
2     10     미성년자
3     21       청년
4     23       청년
5     37       장년
6     31       중년
7     61       노년
8     20       청년
9     41       장년
10    32       중년
11   100      NaN

4. 각 카테고리 별 데이터 수를 출력하세요.

청년      3
장년      2
중년      2
미성년자    2
노년      1
Name: ages_cat, dtype: int64

5. train = pd.read_csv(drive_path + "train.csv", index_col="PassengerId") 실행하세요.

6. train의 각 column별 데이터 수를 출력하세요.

Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

7. 승객중 성별(Sex) 인원수, 나이별(Age) 인원수, 선실별(Pclass), 생존(Survived)인원수 구하세요.

male      577
female    314
Name: Sex, dtype: int64
24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64
3    491
1    216
2    184
Name: Pclass, dtype: int64
0    549
1    342
Name: Survived, dtype: int64

8. 생존한(1) 인원 중 나이별로 사람수 분류하세요.

```
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
```

중년      83
장년      78
청년      75
미성년자    49
노년       5
Name: Age, dtype: int64

9. 사망한(0) 인원 중 나이별로 사람수 분류하세요.

청년      143
장년      117
중년      113
미성년자     34
노년       17
Name: Age, dtype: int64

10. 생존한 인원 중 남성, 여성 출력하세요.

female    233
male      109
Name: Sex, dtype: int64

11. 
```
# groupby
df5 = pd.DataFrame({
    'key1' : ['A','A','B','B','A'],
    'key2' : ['one','two', 'one','two','one'],
    'data1' : [1, 2, 3, 4, 5],
    'data2' : [10, 20, 30, 40, 50]
})
```

#### groupby 연습

In [396]:

df5 = pd.DataFrame({
'key1' : ['A','A','B','B','A'],
'key2' : ['one','two', 'one','two','one'],
'data1' : [1, 2, 3, 4, 5],
'data2' : [10, 20, 30, 40, 50]
})
df5

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

12. key1과 data2 열 데이터를 key1을 기준으로 그룹화 하세요.

13. 각 그룹 별 합계를 출력하세요.

      data2
key1
A        80
B        70

14. train 데이터에서 선실과 성별을 기준으로 생존자 수를 구하세요.

               Survived
Pclass Sex
1      female        91
       male          45
2      female        70
       male          17
3      female        72
       male          47

## merge 는 라이브러리 실습 예제 207!